{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `When you hear the word stepmom does your mind automatically go to Cinderella and her evil stepmother? Fortunately for me my life so far as a stepmom hasn’t been that way. My stepdaughter was 11 months old when I met her. All she has ever known in her life is with me in it. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `A friend of my husband is in a similar situation as ours except that his daughter was around 9 or 10 when he met his new wife. Needless to say, the daughter and new wife don’t get along and when they had a kid of their own it seemed to get worse. I feel bad for the friend because he is in an impossible position of his daughter versus his wife and another child.`, React.createElement(MDXTag, {\n      name: \"br\",\n      components: components,\n      parentName: \"p\"\n    }), `\n`, `Diary of a Stepmom\n4-15-19\nBeing a parent is hard in general. My husband and I have a son together. He is 2 years younger than my stepdaughter. Being a stepmom is much harder. I do everything for her as I would my son but instead get no appreciation or recognition for it. I pick her up from school, attend school functions without my husband, take her to dance and her piano recitals when my husband can’t go, yet the court system could care less or even value my role in her life.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Of course, her mother devalues my role. She is threatened by me. To some degree I get it. If my child was being raised/influenced by another woman I might have a hard time with it. Especially if I had abandonment and control issues like the ex does. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The court system and I mean everyone who associates with the court, like minors counsel, mediators, and therapists, don’t want to see the value that a stepparent can bring to a child. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `I try so much with my stepdaughter. I try to give her life lessons, especially as she is starting to come into puberty. I am not her mother, nor do I want to be, but her mother is very immature, very controlling, and pretty clueless. I always have to remind my stepdaughter to take a shower, wash/brush her hair, give her clothing tips etc.  The hard part is that I have to tread lightly. With my son, we have open communication but with my stepdaughter, there is always this fear that she will say something to her mom and then her mom will turn it around and make false allegations. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The hard thing about being a stepmom, at least for me, is that I never know if my stepdaughter is acting a certain way or doing something because she is an 11-year-old girl or because of her mother’s control. The line is always blurred and I have had so many issues with her mother alienating us and devaluing us that I will automatically think her behavior is just like her mother’s. How can we not, she had 70% of the custody until July of last year. For 10 years the ex had pretty much total manipulation on her. The damage is pretty much already done. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Also, there is a harsh reality that if something were to happen to my husband I don’t know how much my son and I would actually see my stepdaughter. I think the only thing keeping me in her life is my husband. I have no rights to her and since her mother completely disregards me and my son as anything in her life I think we would only potentially have a relationship with her when she is old enough to get away from her mother. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Yours Truly,\nStill Surviving Stepmom`));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"When you hear the word stepmom does your mind automatically go to Cinderella and her evil stepmother? Fortunately for me my life so far as a…","frontmatter":{"title":"Diary of a Stepmom.","date":"04/15/2019","categories":["StepMom","Father's Rights","Parental Allienation","Victims"]},"timeToRead":2,"parent":{"__typename":"File","mtime":"2019-05-01T23:57:03.207Z","birthtime":"2019-05-01T23:57:03.207Z"}}},"pageContext":{"slug":"/diary-of-a-stepmom","prev":null,"next":{"fields":{"slug":"/the-effects-of-false-allegations"},"frontmatter":{"title":"The Effects of False Allegations.","categories":["Court","Father's Rights","False Allegations","Victims"]}}}}