{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `When the ex found out she was pregnant, well actually before that, she stopped working. Just to preface, this woman has a bachelors and masters degree. When they were married she had passed her exams to sell life insurance and had worked in television and was working at a college making decent money at the time, but when they had gotten some puppies then found out she was pregnant, she was done working. That’s right, you read correct, I said puppies. My husband got her two puppies and that was too much for her to handle. She was lazy. She didn’t cook, didn’t clean and overall brought nothing to the table. My husband tells me a story where in an effort to help their relationship she would “cook” him dinner. Her version of cook was getting an already cooked whole chicken and opening a can of corn.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `She couldn’t clean up after the puppies (there was two of them). Then, when she got pregnant she really couldn’t handle it so she sold the dogs. Through the divorce process the ex wanted everything. She didn’t let my husband keep their condo. Remember, she didn’t work so she couldn’t afford to keep it, but she told my husband if she couldn’t keep the condo he couldn’t keep it either. She went and lived with her mother. I should tell you that her and her mother are extremely codependent with each other. After her father died her mother moved literally 300 yards away from my husband an her.  My husband said he could see her apartment from their bedroom. That’s when things got worse in their marriage. It was already a dysfunctional relationship but when the mother in-law moved right near them it got worse. She would talk to her mother multiple times a day and the mother was up in their business all the time. If he thought his ex was bad, her mother was even worse. This is still the case today. The ex mother in-law and the ex and now my step daughter are all enmeshed with each other. They act like they are one person. Imagine a mother in law you despise moving in right next door to you. So when they found out they were pregnant it was just too much. Now, I understand not everyone will understand a man leaving his pregnant wife and will probably judge my husband for that.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Fast forward to when their daughter is born. My husband didn’t even find out his own daughter was born until 4 hours after she came into this world. From that day on it’s been nothing be alienation and selfishness. In this now 11 years of his daughter’s life the ex has never worked. Her mother bought them a big house in an affluent neighborhood. The ex tried to control everything. She controlled the visits. She tried to tell us we needed to purchase the same crib and make her room at our house look exactly like hers. She was, and still is overbearing and controlling. She lived with her mother until 2 years ago... `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `To be continued in part 3…...`));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"When the ex found out she was pregnant, well actually before that, she stopped working. Just to preface, this woman has a bachelors and…","frontmatter":{"title":"Let’s talk about Ex ba-by! (Part 2)","date":"03/15/2019","categories":["Court","Family Intervention"]},"timeToRead":2,"parent":{"__typename":"File","mtime":"2019-03-23T18:27:04.137Z","birthtime":"2019-03-23T18:27:04.137Z"}}},"pageContext":{"slug":"/lets-talk-about-ex-ba-by-part-2","prev":{"fields":{"slug":"/lets-talk-about-ex-ba-by"},"frontmatter":{"title":"Let’s talk about Ex ba-by!","categories":["Court","Family Intervention"]}},"next":{"fields":{"slug":"/co-parenting-i-hate-that-word"},"frontmatter":{"title":"Co-parenting: I hate that word!","categories":["Moving Forward","Motivation"]}}}}