{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `You would think to be a mental health professional that you could identify people’s disorders fairly quickly. All it took was one conversation with two different therapists to learn they thought the ex had a borderline personality disorder. The best advice anyone can seem to give is to disengage, detach, and simply stay away from this personality. It’s easier said than done when outside people are hired such as a co-parenting counselor. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Last July when we got half custody of my step-daughter the mediator also order that my husband and the ex had to attend co-parenting “classes” from a specific lady, who just happened to be a former mediator at the courthouse. They were to meet with her and “follow her recommendations,” and she would provide a report to the court for the next mediation. The courts are no longer allowed to order a parenting plan coordinator. That can only be stipulated by both parties, however, it seems they have found a way around that in our case. This lady is not a licensed therapist so she is not providing co-parenting therapy, which is also not allowed to be ordered. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `My husband and his ex are essentially attending parenting plan coordination sessions with this lady even though she cannot make orders like she would if she were their PPC. She costs $150/hour and has wanted to meet with them every 2-3 weeks. We can not afford this. My husband has recently put up some boundaries because he doesn’t feel safe attending sessions. The ex has already made false allegations in the past and with mediation coming back up in 5 months he can’t take any chances of being near her in a non-public space with no witnesses. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `This lady does not get it. She says the only way she helps facilitate effective co-parenting and communication if they are in the same room. If the tables were turned and the ex was scared of my husband and he abused her would this lady be doing the same thing? I doubt it. Also, my husband cannot take time off of work and spend the “preferred” time of a 90 min session by the lady. When he asked to do a 30 min session she said that that is not as effective. At $150/hour she’s not getting what she wants out of 30 min. Their next session was just to “touch base,” so I am not sure why it takes 90 min and $225 to touch base. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `She is on a power trip because the court has unlawfully given her this authority. She is not solving any problems, in fact, she is making them worse. She comes up with changes to the current order that completely confuse everyone and always seem to take away time from us. She threatens my husband that if he doesn’t attend regular sessions that he could lose time with his daughter. I’m sorry but when did threatening anybody ever produce a positive outcome? My hope in September that when my husband talks to the mediator he can tell them that her services have been a financial hardship on our family, this lady is just about the money and she has not helped the situation. Of course, they all love her in the courthouse so this will definitely be an uphill battle. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Yours Truly,`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Still surviving and totally frustrated`));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"You would think to be a mental health professional that you could identify people’s disorders fairly quickly. All it took was one…","frontmatter":{"title":"Co-Parenting Couselors: They are the worst!.","date":"04/24/2019","categories":["Co-Parenting","Father's Rights","Parental Allienation","Victims"]},"timeToRead":2,"parent":{"__typename":"File","mtime":"2019-05-02T00:07:42.367Z","birthtime":"2019-05-02T00:07:42.367Z"}}},"pageContext":{"slug":"/co-parenting-couselors-they-are-the-worst","prev":null,"next":{"fields":{"slug":"/diary-of-a-stepmom"},"frontmatter":{"title":"Diary of a Stepmom.","categories":["StepMom","Father's Rights","Parental Allienation","Victims"]}}}}