{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `In early 2017 the ex got remarried to a wealthy man and things just became worse. Now she had a sugar daddy and she could use her new financial situation to hire a lawyer who is a complete snake. She claimed poverty while being remarried. She claimed she was “essentially living on credit.” Yeah, your husband’s credit card! She doesn’t provide financially for her child. She leeches off of us and her new husband. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `But let me backup a bit. She had been dating this guy for about 3 years. He was nice. We had met him a few times during pick up/drop off. He had two daughters of his own. Why he was with her, we will never know, but he seemed decent. One day I asked my step daughter Maddie how he was doing. She got really quiet. I asked her when was the last time she saw him and she said she didn’t know. I knew something was up and it seemed they had broken up. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `In late December of 2016 we hear from Maddie’s therapist that the ex is getting remarried and Maddie was told not to tell us. Maddie had just started with this therapist because the ex said she had anxiety. The “anxiety” was because her mom was having her lie to us. The therapist went back to the ex and told her if she didn’t tell us she was getting married then she would. That in itself is a whole different issue. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Anyways, the ex sends us an email that she is getting married in less than a week! We ask her if it’s the same guy she’s been with for the past 3 years. She wouldn’t answer us. We come to find out again from the therapist that all she heard Maddie say was the name Chad. We have never heard about any Chad. Can you imagine how we felt to know that our daughter would be soon living with some man we don’t even know his name? It made us sick to our stomach. We know why the ex hid him and still do to this day. He’s rich and if we knew that we could use that in court. She didn’t even actually tell us she lived with him until they had already been married for 8 months. When she told us she was getting married she said she would let us know where she was moving when she knew the details. She continued to live at her mother’s house. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `From what we knew from Maddie, Chad worked out of town and lived in his beachfront property during the week and would live in his other home on the weekends. The odd thing was Maddie texted us before the new school year started that she had moved and it was close to her school. We believed they were living there at least part time but didn’t want us to know. The ex denied this and told us she would tell us when she knew the details. To us that meant she was waiting for a house to close escrow or something having to do with the availability of a house. This is was Chad’s house where he lived with his ex wife and his two children grew up in this house. Maddie lives in the eldest daughters room now. It was all lies to try to conceal his worth for as long as she could. The sad thing was she involved Maddie in these lies. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The ex shuffled Maddie between 2 homes in addition to the time we had with her. The ex didn’t know we knew his name or where he lived but once Maddie told us it was easy to figure out. Only when we told the ex we knew his name and knew where he lived her jig was up and she had to officially tell us her new address. Even after she officially said she lived there she would still shuffle Maddie between grandma’s and Chad’s. If we were to pick Maddie up at 3pm then they would arrive 20 min before pick up to make it look like they were there the whole time. Since Chad was not there during the week I don’t think they could live there without him. It was all very odd. Who marries someone then just doesn’t live with them? And for 8 months! It’s been two years and we still haven’t met him. We have seen him once from afar at a piano recital. We don’t approach the ex or him for our safety. (More on that another day.) He is 18 years older than the ex and has two adult children from a previous marriage. He lives in a wealthy community in a $4 million dollar home. So this is her life now... She lives with this husband, doesn’t work, drives a new luxury SUV, is sending/paying for Maddie to go to a private school next year, goes on expensive vacations, pays for piano, dance, and horseback riding lessons but continually tells the court she only makes $150/month in a network marketing business, her and her husband keep their finances separate and she doesn’t know how much he makes. The kicker here is the court system doesn’t care! We still have to pay her $1400 a month! We are struggling financially and are in so much debt paying lawyers, credit cards, and a mortgage. We have to cut down on so much and it’s killing us, meanwhile this woman is living a life of luxury and providing no responsibility for her child. How is this right?`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Ps. you would think the way I describe her new life of luxury you think, “oh she’s a total trophy wife.” Nope, not at all. She is very plain and literally dresses like her 11 year old. What he gets out of the relationship, I have no idea. It’s not her looks and its not her winning personality. It’s certainly not her mental stability. I know what she gets out of the relationship with him but I guess there really is someone for everyone. `));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"In early 2017 the ex got remarried to a wealthy man and things just became worse. Now she had a sugar daddy and she could use her new…","frontmatter":{"title":"Let’s talk about Ex ba-by!","date":"03/12/2019","categories":["Court","Family Intervention"]},"timeToRead":4,"parent":{"__typename":"File","mtime":"2019-03-23T18:24:37.066Z","birthtime":"2019-03-23T18:24:37.066Z"}}},"pageContext":{"slug":"/lets-talk-about-ex-ba-by","prev":null,"next":{"fields":{"slug":"/co-parenting-i-hate-that-word"},"frontmatter":{"title":"Co-parenting: I hate that word!","categories":["Moving Forward","Motivation"]}}}}