{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `My husband and I met January 2009. We went to jr. high and high school together and knew of each other but didn’t run in the same circles. In early 2009 he friend requested me on Facebook. There were 3 David's that I knew from high school so I was trying to figure out which one it was because he looked different then I remembered. I don’t remember who contacted who first but we got to chatting on private messages. I think I threw it out there to catch up sometime. We exchanged phone numbers and agreed to go out. It was Sunday. He came and picked me up from my apartment and we went to California Pizza Kitchen. I remember him saying he had never been on date with someone from high school and I remember not caring that he called it a date. I had had a similar situation with another guy and when he called it a date I quickly corrected him that it was not a date, so when David called it a date, I was ok with it. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Afterward we went back to my place and he ended up staying over. From then on we were together all the time. We moved in together 5 weeks later, found out we were pregnant 8 months later and were married 10 months after that first date. Now we are coming up on almost 10 years together. From day one I knew David had a daughter. His daughter Maddie was 11 months old when we met. She wasn't even walking or talking. I met his ex wife Beth only a few weeks into dating David. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `At the time we met the ex was controlling the visitation schedule. Looking back we should have known how bad it was going to get. She controlled when he saw Maddie. She would choose the time and David would have to go. It was only 3 hours on the weekend days. He would meet her at the mall and he would walk around. Once we started dating I joined in on the ridiculous visits at the mall. Walking around with not even a toddler yet. Looking back and when you read the other stories I’m willing to bet she was there too watching us. Maddie 11 now and the ex still inserts herself everywhere Maddie is, so when she was not even 1 year old you know she stalked us or at least stayed in the parking lot. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Before David met me he had told himself he would never get married again. I can see why. The ex was emotionally and physically abusive to David and extremely controlling, she still is. David suffers from PTSD and other emotional distress from their relationship. However, after we met he wanted to have more kids and get married. He also wanted more time with his daughter, thus started a journey through the court system which has meant multiple court dates, attorneys and lots of disagreements. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `David had given into the ex too much. He felt gulity because he left her when she was 3 months pregnant. They had gone through mulitple therapists and even after Maddie was born tried to see if they would get back together just for the sake of her. However the ex wouldn’t change and chose to stay with her mother, who may even be worse than the ex, over David. This was just 1 month before we met so you can see that the ex was not happy when I arrived and didn’t like me. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `From day one of our relationship the ex was a constant thorn in our ass. We don’t know anything different. We don’t know a life without dealing with a crazy, irrational, narrsassitic, borderline, immature woman. At least we have gone through more years then we have left until Maddie turns 18.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, ` We have had times where we have stayed out of the court system. We went to court in 2010 before our son Charlie was born and we got overnights with Maddie. We wanted to go back and almost did because we wanted half time but we stayed away because we feared what her mom would do and say. So we stayed out of court for about 6 years...Until December 2016. Clams of denying orthodontic care sparked a 2 year battle and us finally getting that 50/50 time with Maddie. Unfortunately within those 2 years alot of bad shit went down and it was and still is a crazy road to getting Maddie away from her controlling mother, at least half of the time. The ex has become even more crazy, if that was even possible. We have a minor's counsel, a therapist for Maddie and a co parenting counselor. Each party has their own lawyer and just in these two years more than $150k has been spent.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `  This blog serves as therapy for me as a means to get this information out of my head so I can try to move forward from it but also to help anyone else out there dealing with a similar situation. No two situations can be the same because no two people are the same but at least others know there are other people out there who feel their pain. I understand this is a one side to the stoy and I will share some of the bad decisions and mistakes we made that led to us losing in court at times. When you deal with a person who is borderline/historonic/narsasstic you ultimatley will fuck up because they are too good at playing the victim and manipulating others. I know when I have read books on crazy exs it certainly helped to know that we weren’t alone, however it is still frustrating because these mental illnesses suck at the life out of the you and completely consume you. Admittedly we have let this woman control our life and let it bother us, but I challenge anyone to try to deal with her. You too would see that pounding your head against the wall repeatedly would be better! `));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"My husband and I met January 2009. We went to jr. high and high school together and knew of each other but didn’t run in the same circles…","frontmatter":{"title":"In the beginning...","date":"01/24/2019","categories":["Start Here"]},"timeToRead":4,"parent":{"__typename":"File","mtime":"2019-03-15T03:43:13.974Z","birthtime":"2019-03-15T03:43:13.974Z"}}},"pageContext":{"slug":"/in-the-beginning","prev":null,"next":null}}