{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The minute you get divorced with the children the first word you hear is co-parenting. When a celebrity couple divorces you hear the news say they will continue to co-parent for the sake of their children. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `But what if your ex is literally incapable of co-parenting? Co-parenting assumes that you have two equally rational, mature people who can put their shit aside and can try to make mutual decisions for their child(ren). `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `In our case co-parenting has never happened. In the ex’s vocabulary co-parenting means do everything I want you to do. If we even voice an opinion that is different than hers then we are the ones who aren’t “co-parenting.” My husband and the ex are court-ordered to go see this co-parenting counselor. The court worded it as “classes” but its a sneaky way of basically ordering a PPC (parenting plan coordinator) which where we live is not legal to do. This “counselor” is fully aware that my husband and the ex do not trust or even remotely like each other, yet she continually takes our money and tries to get these two people who are not capable of working together, work together. When my husband has to give in (or they threaten his custody), like he always does, they praise the ex for being a good co-parent because she will agree. Do we not see how messed up that is? Of course, she agrees, she got what she wanted!`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `At some point people (and I mean everyone involved with the courts) need to just see and accept that co-parenting is not always the best thing. Our lives would be easier if we could just parallel parent. If she just did her thing on her custodial time and we did ours. The ex constantly needs to know what is happening on our time. If there is an event for the child she needs to know and puts rules on when she needs to know by. By forcing two people to co-parent you are causing more problems. A leopard doesn’t change its spots. They see the ex can’t co-parent yet they keep trying.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Admittingly, we tried for too long to think that the ex might stop being so crazy if this or that happened but she never did. She got worse. Everyone (counselors, therapists, lawyers) thinks that they can be the ones who can get these two to work together. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `At some point, we just have to admit to ourselves that there is a reason why their relationship failed and by trying to keep these people in constant contact via counseling sessions and allowing the ex to run and tattle to them every time is just making everything so much worse.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Yours Truly,`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `  Still Surviving`));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"The minute you get divorced with the children the first word you hear is co-parenting. When a celebrity couple divorces you hear the news…","frontmatter":{"title":"Co-parenting: I hate that word!","date":"03/17/2019","categories":["Moving Forward","Motivation"]},"timeToRead":2,"parent":{"__typename":"File","mtime":"2019-03-23T18:24:28.774Z","birthtime":"2019-03-23T18:24:28.774Z"}}},"pageContext":{"slug":"/co-parenting-i-hate-that-word","prev":{"fields":{"slug":"/lets-talk-about-ex-ba-by-part-2"},"frontmatter":{"title":"Let’s talk about Ex ba-by! (Part 2)","categories":["Court","Family Intervention"]}},"next":{"fields":{"slug":"/the-court-system-helping-or-hurting"},"frontmatter":{"title":"The court system: helping or hurting?","categories":["Court","Family Intervention"]}}}}