{"data":{"mdx":{"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nconst layoutProps = {};\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `It’s December 28th, 2017. Around 3 pm we get a knock on the door. It is the police department. They tell me they want to speak to my husband because of an incident that happened at the courthouse today. He had gone for a walk so I didn’t know where he was.  They were not there to just speak to him. They told me if he didn’t call the department back by 7 pm they would have to put a warrant out for his arrest. We had no idea why they would be arresting him.\nEarlier that day he was in court with the ex over orthodontic issues. His ex was claiming he was denying her orthodontic care when in reality he just wanted some more opinions on what the right treatment would be. His ex didn’t like that and wanted to control the situation so she took him to ex parte thus started numerous court proceedings. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `I didn’t go to court with him that day, which I usually do. Three days prior I had found out I was pregnant and wasn’t feeling good and going to court early in the morning was going to be rough. (Sadly, a couple of months later we lost that baby.) So, I sent my father in law with him. If I had been there that day no allegations would have been made.\nAfter court, my husband had a conversation with his ex, big mistake. He was upset and was asking her why she doesn’t agree to their daughter living with us more. She had brought a friend with her that day and while my husband was talking to his ex she was talking to my father in law 10 feet away. My father in law should have never left my husband's side.  There was no scene and nobody had to intervene. If you have ever been to court you know police are everywhere.  My husband and father in law walked away to his car and she went the other direction.\nBack to when the cops show up at the house. They leave because my husband wasn’t back yet. He calls them that night and they take his statement. At this point, he still doesn’t know why they are questioning him. They come back to our house to say they need him to sign some paperwork but instead, they arrest him. They knew all along they were going to arrest him. They handcuff him and take him to jail. They had no regard that my 6-year-old son was right there. I had to bail him out.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Only after he was released did he find out why he was arrested. They had interrogated him but fortunately, my husband was smart to invoke his right to remain silent. They had been trying to coerce a confession out of him. My husband was charged with threatening to kill his ex-wife and his daughter as well as false imprisonment. Apparently, you can just say someone threatened you without any proof and you just get arrested, at least in the county we live in. A temporary restraining order was issued on my husband and we didn’t see my stepdaughter for a month.\nWe had to hire a criminal attorney. Fortunately, my husband never had to appear in criminal court. The DA rejected the case. He had no history of abuse or allegations and had a clean record. We went to trial in family court and the ex’s case for a permanent restraining order was denied. The judge didn’t believe the threat happened.\nNow you would think that the fact that we “won” would have been great, but it wasn’t. Knowing his ex would just outright lie and the police just come and arrest you scared us. We didn’t feel safe anymore. We had to video record every time we had to be near her. Even though the ex made these claims she still fought for them to attend co-parenting counseling. Who fights for a restraining order then wants to be in the same room with them week after week? A crazy person, that’s who. I'm sorry but if I thought someone threatened my life or my child’s life I wouldn’t want to go anywhere near them, but not her. Two years later and she still wants to go to meetings with him and thinks them being in the same room is beneficial. My husband finally drew the line and said no way. If they have to meet with their co-parenting counselor he calls him and she attends in person. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The thing is, nobody really understands. People think being arrested is no big deal. It is. It costs lots of money and can cause a form of PTSD. The police are not nice to you and they treat you like you did it. You are guilty until proven innocent, not the other way around. Two years later and we still avoid the ex like the plague. Both my husband and I get anxiety when we have to go to a school event or extracurricular activity. It’s not a healthy way to live. The court and everyone involved including co-parenting counselors try to get them to co-parent. How do you co-parent with someone who made false allegations that are so horrific? How do you talk to that person and talk about birthday parties, vacation schedules, etc. when that person won’t even acknowledge they did. The ex won’t even talk about it if it’s brought up.\nWe live in a constant fear that it will happen again and that the next allegation will be of the sexual abuse kind.  Nobody should have to live that way. She went past the point of no return. Never can we be in a place where we think she can be anything but what she has always been, an abusive, narcissist, who has a borderline personality disorder. We had to learn the hard way. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Yours Truly,\nStill Surviving`));\n  }\n\n}\nMDXContent.isMDXComponent = true;"},"excerpt":"It’s December 28th, 2017. Around 3 pm we get a knock on the door. It is the police department. They tell me they want to speak to my husband…","frontmatter":{"title":"The Effects of False Allegations.","date":"04/17/2019","categories":["Court","Father's Rights","False Allegations","Victims"]},"timeToRead":4,"parent":{"__typename":"File","mtime":"2019-05-01T23:47:34.001Z","birthtime":"2019-05-01T23:47:34.001Z"}}},"pageContext":{"slug":"/the-effects-of-false-allegations","prev":{"fields":{"slug":"/diary-of-a-stepmom"},"frontmatter":{"title":"Diary of a Stepmom.","categories":["StepMom","Father's Rights","Parental Allienation","Victims"]}},"next":{"fields":{"slug":"/not-until-you-walk-in-someone-elses-shoes"},"frontmatter":{"title":"Not until you walk in someone else’s shoes.","categories":["Court","Family Intervention","Empathy","Victims"]}}}}